app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
	def index
		@user = User.find(current_user.id)
		@users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 5]]
---
	def show
		@user = User.find(params[:id])
		@books = Book.where(user_id: @user.id)

SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "44f1f477f29eae8368da669896193a45958f70e9aa5824e88ccacd2f392a"], ["updated_at", "2020-08-23 12:10:27.889676"], ["id", 5]]
---
	def update
		@books = Book.all
		@book = Book.new
		@user = User.find(current_user.id)
		if @user.update(user_params)